Конфигурация/Documents/ПереоценкаКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереоценкаКредитныхИнструментов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоцениватьНаОснованииНастроекУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КредитныеИнструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КредитныйИнструмент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценочнаяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПереоценкаКредитныхИнструментов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ЗаполнитьНаСервере()

	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Отказ = Ложь;
	ТекущийОбъект.ЗаполнитьКредитныеИнструменты(Отказ);
	
	Если Объект.ПереоцениватьНаОснованииНастроекУчета Тогда
		ТекущийОбъект.ПрименитьПолитикуУчета();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаЛинейнойСтоимости(Команда)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьФорму("Справочник.ДепозитныеВклады.Форма.РасшифровкаСтоимостиДепозита", Новый Структура("СчетДоверительногоУправления,КредитныйИнструмент,Период", Объект.СчетДоверительногоУправления, ТекущиеДанные.КредитныйИнструмент, КонецДня(Объект.Дата)));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСтоимостиАктиваПоРыночнойСтавке(Команда)
	
	ТекущиеДанные = Элементы.ЦенныеБумаги.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Отказ = Ложь;
		
		Результат = РасшифровкаСтоимостиАктиваПоРыночнойСтавкеСервер(
						ТекущиеДанные.КредитныйИнструмент, 
						Объект.СчетДоверительногоУправления, 
						КонецДня(Объект.Дата), 
						ПредопределенноеЗначение("Справочник.ЦелиРасчета.ЕдиныйПланСчетов"), 
						Отказ);
		
		Если Отказ Тогда
			Предупреждение("Проверка на рыночность завершилась с ошибками. См. окно сообщений",, "Расшифровка стоимости активов");
		Иначе
			ИмяРасшифровки = РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(Строка(ТекущиеДанные.КредитныйИнструмент) + " на " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));
			Результат.Показать(ИмяРасшифровки);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасшифровкаСтоимостиАктиваПоРыночнойСтавкеСервер(Актив, СчетДоверительногоУправления, Период, ЦельРасчета, Отказ)
	
	Возврат РаботаСоСтоимостьюПоРыночнойСтавке.РасшифровкаСтоимостиАктиваПоРыночнойСтавке(Актив, СчетДоверительногоУправления, Период, ЦельРасчета,, Отказ);
	
КонецФункции

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияПриИзменении(Объект.СчетДоверительногоУправления, ЭтаФорма);

КонецПроцедуры
